{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f11b5318",
   "metadata": {},
   "outputs": [],
   "source": [
    "from generation.ontology.event_retriever import EventRetriever\n",
    "from generation.ontology.similarity_calculator import LocalSemanticSimilarityCalculator\n",
    "from generation.adaptation.astar import ConstructiveAdaptation\n",
    "from generation.adaptation.query import Query\n",
    "from common.utils.loader import load_json_folder, load_txt_folder, data_dir, out_dir, save_raw_folktale, load_json\n",
    "from generation.ontology.folktale_graph import FolktaleOntology\n",
    "from loguru import logger\n",
    "from rdflib import Graph\n",
    "from dotenv import load_dotenv\n",
    "from generation.story_generator import generate_story\n",
    "from common.models.folktale import AnnotatedFolktale\n",
    "import os\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6aac1601",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_graph(build: bool=False, render_html: bool=False) -> Graph:\n",
    "\tgraph = FolktaleOntology()\n",
    "\tif build:\n",
    "\t\thierarchies = load_json_folder(f\"{data_dir}/hierarchies\")\n",
    "\t\tgraph.build(hierarchies)\n",
    "\n",
    "\t\texamples = load_json_folder(f\"{data_dir}/examples/annotated\")\n",
    "\t\tfor folktale in examples.values():\n",
    "\t\t\tgraph.add_folktale(folktale)\n",
    "\n",
    "\t\tgraph.add_imports()\n",
    "\t\tgraph.save()\n",
    "\t\tif render_html:\n",
    "\t\t\tgraph.render_html(\"instances\")\n",
    "\n",
    "\tlogger.debug(f\"Grafo initialized with {len(graph)} triplets.\")\n",
    "\n",
    "\tgraph.load()\n",
    "\n",
    "\tlogger.debug(f\"Grafo initialized with {len(graph)} triplets after loading.\")\n",
    "\n",
    "\treturn graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bf833b3b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\u001b[32m2026-01-07 13:04:33.776\u001b[0m | \u001b[34m\u001b[1mDEBUG   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mcreate_graph\u001b[0m:\u001b[36m16\u001b[0m - \u001b[34m\u001b[1mGrafo initialized with 0 triplets.\u001b[0m\n",
      "\u001b[32m2026-01-07 13:04:33.807\u001b[0m | \u001b[34m\u001b[1mDEBUG   \u001b[0m | \u001b[36m__main__\u001b[0m:\u001b[36mcreate_graph\u001b[0m:\u001b[36m20\u001b[0m - \u001b[34m\u001b[1mGrafo initialized with 1112 triplets after loading.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "graph = create_graph(build=False,\n",
    "\t\t\t\t\t\t render_html=False)\n",
    "\t\n",
    "event_retriever = EventRetriever(graph)\n",
    "sim_calculator = LocalSemanticSimilarityCalculator(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "76f0492a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def execute_query(query: str):\n",
    "\ttry:\n",
    "\t\tresults = graph.query(query)\n",
    "\t\tresult_list = list(results)\n",
    "\t\treturn result_list\n",
    "\texcept Exception as e:\n",
    "\t\tprint(\"Error in SPARQL query:\", e)\n",
    "\t\treturn []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "7b7a13a7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Namespace\n",
    "from rdflib.namespace import RDF, RDFS\n",
    "\n",
    "ONT = Namespace(\"https://rbc.org/ontology/\")\n",
    "RES = Namespace(\"https://rbc.org/resources/\")\n",
    "\n",
    "WD = Namespace(\"http://www.wikidata.org/entity/\")\t\t# elementos\n",
    "WDT = Namespace(\"http://www.wikidata.org/prop/direct/\")\t# propiedades\n",
    "SCHEMA = Namespace(\"https://schema.org/\")\n",
    "\n",
    "SEM = Namespace(\"http://semanticweb.cs.vu.nl/2009/11/sem/\")\n",
    "REL = Namespace(\"http://purl.org/vocab/relationship/\")\n",
    "PEARL = Namespace(\"https://www.gsi.upm.es/ontologies/pearl/\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "5356537c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_event_type_name(event_uri: str) -> str | None:\n",
    "    query = f\"\"\"\n",
    "    PREFIX rdf: <{RDF}>\n",
    "    PREFIX ont: <{ONT}>\n",
    "\n",
    "    SELECT ?type\n",
    "    WHERE {{\n",
    "        <{event_uri}> rdf:type ?type .\n",
    "        FILTER(STRSTARTS(STR(?type), STR(ont:)))\n",
    "    }}\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    "    \n",
    "    results = execute_query(query)\n",
    "\n",
    "    if not results:\n",
    "        return None\n",
    "\n",
    "    return str(results[0].type).split(\"/\")[-1]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8149fc69",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_event_type(event_uri: str) -> list[str]:\n",
    "    query = f\"\"\"\n",
    "    PREFIX rdf: <{RDF}>\n",
    "    \n",
    "    SELECT ?type\n",
    "    WHERE {{\n",
    "        <{event_uri}> rdf:type ?type .\n",
    "    }}\n",
    "    \"\"\"\n",
    "    \n",
    "    results = execute_query(query)\n",
    "    return [str(row.type) for row in results]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "d324dd87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Setup'"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_event_type_name(\"https://rbc.org/resources/event/the_hare_and_the_tortoise/challenge_issued\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a6402218",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_folktales_by_genre(genre: str) -> list[str]:\n",
    "\tgenre_map = {\n",
    "\t\t\"fable\": \"wd:Q693\",\n",
    "\t\t\"fairy_tale\": \"wd:Q699\",\n",
    "\t\t\"legend\": \"wd:Q44342\",\n",
    "\t\t\"myth\": \"wd:Q12827256\",\n",
    "\t\t\"tall_tale\": \"wd:Q1951220\",\n",
    "\t}\n",
    "\n",
    "\tif genre not in genre_map:\n",
    "\t\traise ValueError(f\"Unsupported genre: {genre}\")\n",
    "\n",
    "\tgenre_wd = genre_map[genre]\n",
    "\n",
    "\tquery = f\"\"\"\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX rdf: <{RDF}>\n",
    "\tPREFIX ont: <{ONT}>\n",
    "\tPREFIX wd: <{WD}>\n",
    "\n",
    "\tSELECT ?folktale ?title\n",
    "\tWHERE {{\n",
    "\t\t?folktale a ont:Folktale ;\n",
    "\t\t   ont:hasGenre {genre_wd} ;\n",
    "\t\t   ont:title ?title .\n",
    "\t}}\n",
    "\t\"\"\"\n",
    "\tresults = execute_query(query)\n",
    "\n",
    "\treturn [(str(result.folktale), str(result.title))for result in results] if results else []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3607b798",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('https://rbc.org/resources/folktale/the_hare_and_the_tortoise',\n",
       "  'The Hare and The Tortoise'),\n",
       " ('https://rbc.org/resources/folktale/the_three_little_pigs',\n",
       "  'The Three Little Pigs')]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_folktales_by_genre(\"fable\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "97ecbbfe",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_roles_by_type_and_folktale_genre(role_type,genre\n",
    ") -> list[tuple[str, str, str]]:\n",
    "\t\"\"\"\n",
    "\tReturns:\n",
    "\t\t[(role_uri, role_label, folktale_title), ...]\n",
    "\t\"\"\"\n",
    "\n",
    "\tquery = f\"\"\"\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX rdf: <{RDF}>\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX ont: <{ONT}>\n",
    "\tPREFIX wd: <{WD}>\n",
    "\n",
    "\n",
    "\tSELECT DISTINCT ?agent ?roleLabel ?folktaleTitle\n",
    "\tWHERE {{\n",
    "\t\t?folktale a ont:Folktale ;\n",
    "\t\t\t\t  ont:hasGenre <{genre}> ;\n",
    "\t\t\t\t  ont:title ?folktaleTitle ;\n",
    "\t\t\t\t  ont:hasEvent ?event .\n",
    "\n",
    "\t\t?event ont:hasAgent ?agent .\n",
    "\t\t?agent ont:hasRole ?role .\n",
    "\n",
    "\t\t?role rdf:type <{role_type}> .\n",
    "\t\tOPTIONAL {{ ?role rdfs:label ?roleLabel }}\n",
    "\t}}\n",
    "\t\"\"\"\n",
    "\n",
    "\tresults = execute_query(query)\n",
    "\n",
    "\treturn [\n",
    "\t\t(str(row.agent), str(row.roleLabel), str(row.folktaleTitle))\n",
    "\t\tfor row in results\n",
    "\t]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b7d40457",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_place_by_type_and_folktale_genre(place_type,genre\n",
    ") -> list[tuple[str, str, str]]:\n",
    "\n",
    "\tquery = f\"\"\"\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX rdf: <{RDF}>\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX ont: <{ONT}>\n",
    "\tPREFIX wd: <{WD}>\n",
    "\n",
    "\n",
    "\tSELECT DISTINCT ?place ?placeLabel ?folktaleTitle\n",
    "\tWHERE {{\n",
    "\t\t?folktale a ont:Folktale ;\n",
    "\t\t\t\t  ont:hasGenre <{genre}> ;\n",
    "\t\t\t\t  ont:title ?folktaleTitle ;\n",
    "\t\t\t\t  ont:hasEvent ?event .\n",
    "\n",
    "\t\t?event ont:hasPlace ?place .\n",
    "\t\t?place rdf:type ont:{place_type} .\n",
    "\t\tOPTIONAL {{ ?place rdfs:label ?placeLabel }}\n",
    "\t}}\n",
    "\t\"\"\"\n",
    "\n",
    "\tresults = execute_query(query)\n",
    "\n",
    "\treturn [\n",
    "\t\t(str(row.place), str(row.placeLabel), str(row.folktaleTitle))\n",
    "\t\tfor row in results\n",
    "\t]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "f467d2a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "results = get_place_by_type_and_folktale_genre(\n",
    "    place_type=\"Forest\",\n",
    "    genre=\"Q693\"  # Fable\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "4b1711ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('https://rbc.org/resources/place/the_hare_and_the_tortoise/race_track',\n",
       "  'Race Track',\n",
       "  'The Hare and The Tortoise')]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "dac7de8f",
   "metadata": {},
   "outputs": [],
   "source": [
    "roles = get_roles_by_type_and_folktale_genre(\n",
    "\trole_type=ONT.Hero,\n",
    "\tgenre=FolktaleOntology.GENRE_MAP[\"fable\"]\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "298f19fa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('https://rbc.org/resources/agent/the_hare_and_the_tortoise/tortoise',\n",
       "  'Hero',\n",
       "  'The Hare and The Tortoise'),\n",
       " ('https://rbc.org/resources/agent/the_three_little_pigs/pig_three',\n",
       "  'Hero',\n",
       "  'The Three Little Pigs')]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "roles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "1ca51644",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_objects_by_type_and_genre(object_type,genre\n",
    ") -> list[tuple[str, str, str]]:\n",
    "\t\n",
    "\n",
    "\tquery = f\"\"\"\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX rdf: <{RDF}>\n",
    "\tPREFIX rdfs: <{RDFS}>\n",
    "\tPREFIX ont: <{ONT}>\n",
    "\tPREFIX wd: <{WD}>\n",
    "\n",
    "\n",
    "\tSELECT DISTINCT ?object ?objectLabel ?folktaleTitle\n",
    "\tWHERE {{\n",
    "\t\t?folktale a ont:Folktale ;\n",
    "\t\t\t\t  ont:hasGenre <{genre}> ;\n",
    "\t\t\t\t  ont:title ?folktaleTitle ;\n",
    "\t\t\t\t  ont:hasEvent ?event .\n",
    "\n",
    "\t\t?event ont:hasObject ?object .\n",
    "\t\t?object rdf:type ont:{object_type} .\n",
    "\t\tOPTIONAL {{ ?object rdfs:label ?objectLabel }}\n",
    "\t}}\n",
    "\t\"\"\"\n",
    "\n",
    "\tresults = execute_query(query)\n",
    "\n",
    "\treturn [\n",
    "\t\t(str(row.object), str(row.objectLabel), str(row.folktaleTitle))\n",
    "\t\tfor row in results\n",
    "\t]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "bdd903be",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('https://rbc.org/resources/object/the_three_little_pigs/straw',\n",
       "  'Straw',\n",
       "  'The Three Little Pigs'),\n",
       " ('https://rbc.org/resources/object/the_three_little_pigs/stick',\n",
       "  'Stick',\n",
       "  'The Three Little Pigs')]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_objects_by_type_and_genre(\"NaturalObject\",FolktaleOntology.GENRE_MAP[\"fable\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4d092cee",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_ordered_events_for_agent(agent_uri) -> list[tuple[str, str]]:\n",
    "    query = f\"\"\"\n",
    "    PREFIX rdfs: <{RDFS}>\n",
    "    PREFIX ont: <{ONT}>\n",
    "\n",
    "    SELECT ?event ?label ?eventType (COUNT(?prev) AS ?order)\n",
    "    WHERE {{\n",
    "        ?event ont:hasAgent <{agent_uri}> ;\n",
    "            rdf:type ?eventType .\n",
    "        OPTIONAL {{ ?event rdfs:label ?label }}\n",
    "\n",
    "        OPTIONAL {{\n",
    "            ?prev ont:postEvent+ ?event .\n",
    "        }}\n",
    "    }}\n",
    "    GROUP BY ?event ?label\n",
    "    ORDER BY ?order\n",
    "    \"\"\"\n",
    "    results = execute_query(query)\n",
    "\n",
    "    return [\n",
    "        (str(r.eventType),str(r.event), str(r.label),str(r.order))\n",
    "        for r in results\n",
    "    ]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "06bf5a8c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://rbc.org/ontology/Setup\n",
      "https://rbc.org/ontology/Conflict\n",
      "https://rbc.org/ontology/Setup\n",
      "https://rbc.org/ontology/Setup\n",
      "https://rbc.org/ontology/Move\n",
      "https://rbc.org/ontology/ConnectiveIncident\n",
      "https://rbc.org/ontology/Victory\n"
     ]
    }
   ],
   "source": [
    "agent_uri = \"https://rbc.org/resources/role/the_three_little_pigs/hero\"\n",
    "\n",
    "events = get_ordered_events_for_agent(roles[0][0])\n",
    "\n",
    "for eventType,event_uri, label,order in events:\n",
    "    print(eventType)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "87d27af3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('https://rbc.org/ontology/Setup',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/challenge_issued',\n",
       "  'Challenge Issued',\n",
       "  '0'),\n",
       " ('https://rbc.org/ontology/Conflict',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/antagonist_mocking_hero',\n",
       "  'Antagonist Mocking Hero',\n",
       "  '1'),\n",
       " ('https://rbc.org/ontology/Setup',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/challenge_accepted',\n",
       "  'Challenge Accepted',\n",
       "  '2'),\n",
       " ('https://rbc.org/ontology/Setup',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/race_begins',\n",
       "  'Race Begins',\n",
       "  '3'),\n",
       " ('https://rbc.org/ontology/Move',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/hero_steady_progress',\n",
       "  'Hero Steady Progress',\n",
       "  '5'),\n",
       " ('https://rbc.org/ontology/ConnectiveIncident',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/hero_passing_antagonist',\n",
       "  'Hero Passing Antagonist',\n",
       "  '6'),\n",
       " ('https://rbc.org/ontology/Victory',\n",
       "  'https://rbc.org/resources/event/the_hare_and_the_tortoise/hero_wins_race',\n",
       "  'Hero Wins Race',\n",
       "  '8')]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "events"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "66dc3b3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_role_classes(event_uri: str):\n",
    "\t\tquery = f\"\"\"\n",
    "\t\tPREFIX rdfs: <{RDFS}>\n",
    "\t\tPREFIX rdf: <{RDF}>\n",
    "\t\tPREFIX ont: <{ONT}>\n",
    "\n",
    "\t\tSELECT ?roleClass (COUNT(?role) AS ?roleCount) (GROUP_CONCAT(DISTINCT ?agent; separator=\", \") AS ?agents)\n",
    "\t\tWHERE {{\n",
    "\t\t\t<{event_uri}> ont:hasAgent ?agent .\n",
    "\t\t\t?agent ont:hasRole ?role .\n",
    "\t\t\t?role rdf:type ?roleClass .\n",
    "\t\t}}\n",
    "\t\tGROUP BY ?roleClass\n",
    "\t\t\"\"\"\n",
    "\n",
    "\t\tresults = execute_query(query)\n",
    "\n",
    "\t\tif results:\n",
    "\t\t\tdict_result = {str(result.roleClass).split('/')[-1]: (int(result.roleCount), str(result.agents).split(',')) for result in results}\n",
    "\t\t\treturn dict_result\n",
    "\t\treturn {}\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "5de90782",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_object_classes(event_uri: str):\n",
    "    query = f\"\"\"\n",
    "    PREFIX rdfs: <{RDFS}>\n",
    "    PREFIX rdf: <{RDF}>\n",
    "    PREFIX ont: <{ONT}>\n",
    "\n",
    "    SELECT ?objectClass (COUNT(?object) AS ?objectCount) (GROUP_CONCAT(DISTINCT ?object; separator=\",\") AS ?objects)\n",
    "    WHERE {{\n",
    "        <{event_uri}> ont:hasObject ?object .\n",
    "        ?object rdf:type ?objectClass .\n",
    "    }}\n",
    "    GROUP BY ?objectClass\n",
    "    \"\"\"\n",
    "\n",
    "    results = execute_query(query)\n",
    "\n",
    "    if results:\n",
    "        dict_result = {str(result.objectClass).split('/')[-1]: (int(result.objectCount),str(result.objects).split(',') ) for result in results}\n",
    "        return dict_result\n",
    "\n",
    "    return {}\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "6fae9c67",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_object_classes(\"https://rbc.org/resources/event/the_three_little_pigs/villain_fails_sturdy_house\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "9576f3c2",
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'd' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mNameError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[18]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m \u001b[43md\u001b[49m[\u001b[33m\"\u001b[39m\u001b[33mHeroFamily\u001b[39m\u001b[33m\"\u001b[39m][\u001b[32m1\u001b[39m][\u001b[32m0\u001b[39m]\n",
      "\u001b[31mNameError\u001b[39m: name 'd' is not defined"
     ]
    }
   ],
   "source": [
    "d[\"HeroFamily\"][1][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cb13df55",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "folktales (3.12.8)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
